In [1]:
import pandas as pd

In [3]:
idades = [25, 30, 35, 40, 45, 50, 55, 60, 65, 70, 75, 80, 85, 90, 95]
nomes = ['alberto', 'bia', 'carlos', 'dani', 'ellen', 'fernanda', 'gil',
          'helio', 'iniesta', 'jasmim', 'kleberson', 'luana', 'mateus',
          'naiara', 'ofelia']

In [4]:
serie_idades = pd.Series(idades)
serie_nomes = pd.Series(nomes)

In [9]:
# Criando um DataFrame a partir das Series
df = pd.DataFrame()
df['idade'] = serie_idades
df['nome'] = serie_nomes
df

    idade       nome
0      25    alberto
1      30        bia
2      35     carlos
3      40       dani
4      45      ellen
5      50   fernanda
6      55        gil
7      60      helio
8      65    iniesta
9      70     jasmim
10     75  kleberson
11     80      luana
12     85     mateus
13     90     naiara
14     95     ofelia

In [8]:
df['idade']

0     25
1     30
2     35
3     40
4     45
5     50
6     55
7     60
8     65
9     70
10    75
11    80
12    85
13    90
14    95
Name: idade, dtype: int64

In [10]:
# Acessando o primeiro registro do DataFrame
df.iloc[0]

idade         25
nome     alberto
Name: 0, dtype: object

In [12]:
# Acessa o primeiro valor, com ilocs e me entrega o nome
df.iloc[0]['nome']

'alberto'

In [13]:
# Idade da ultima pessoa
df.iloc[-1]['idade']

np.int64(95)